using Microsoft.VisualStudio.TestTools.UnitTesting;
using System.IO;
using System.Collections.Generic;
using ExcelReportingLib;

namespace Grouping.Tests
{
    [TestClass()]
    public class ReportGeneratorTests
    {
        [TestMethod()]
        public void ReportGenerator_GetExcelReport()
        {
            ReportGeneratorWithGraphics reportGenerator = new ReportGeneratorWithGraphics();
            Dictionary<string, string> configuration = new Dictionary<string, string>();
            configuration.Add(ExcelReportingCommon.ConfigurationKeys.Format, ExcelReportingCommon.Formats.CSV);
            reportGenerator.Prepare(SourceDataCSV, configuration);
            var excelStream = reportGenerator.GetExcelReport();
            if (excelStream != null)
            {
                string fileName = "test.xlsx";
                using (var fs = new FileStream(fileName, FileMode.Create))
                {
                    excelStream.CopyTo(fs);
                }
            }
        }

        [TestMethod()]
        public void ReportGenerator_Prepare()
        {
            ReportGenerator reportGenerator = new ReportGenerator();
            reportGenerator.Prepare(SourceData, null);
            Assert.IsNotNull(reportGenerator.ReportData);
        }

        [TestMethod()]
        public void ReportGenerator_LoadCSV()
        {
            ReportData reportData = ReportGenerator.LoadCSV(SourceDataCSV);
            Assert.IsNotNull(reportData);
        }

        #region Тестовые данные

        public static string SourceDataCSV =
@"// * Поставки
//countryId;regionId;companyId;productId;contract;date;sum
1;1;1;1;112/04-2016;2016-04-11;2053673
1;1;1;1;118/04-2016;2016-04-15;3106752
1;1;1;1;125/04-2016;2016-04-21;2837659
1;1;1;1;134/05-2016;2016-05-12;1921061
1;1;1;1;152/05-2016;2016-05-25;2361842
1;1;1;1;176/06-2016;2016-06-07;2227749
1;1;1;1;183/06-2016;2016-06-15;2872523
1;1;1;1;187/06-2016;2016-06-21;1867594
1;1;1;1;195/06-2016;2016-06-23;2148918
1;1;1;2;112/04-2016;2016-04-11;1753967
1;1;1;2;118/04-2016;2016-04-15;1716989
1;1;1;2;125/04-2016;2016-04-21;780789
1;1;1;2;134/05-2016;2016-05-12;2543985
1;1;1;2;152/05-2016;2016-05-25;1621460
1;1;1;2;176/06-2016;2016-06-07;2593240
1;1;1;2;183/06-2016;2016-06-15;2188057
1;1;1;2;187/06-2016;2016-06-21;2788386
1;1;1;2;195/06-2016;2016-06-23;885713
1;1;1;3;112/04-2016;2016-04-11;2748916
1;1;1;3;118/04-2016;2016-04-15;2760774
1;1;1;3;125/04-2016;2016-04-21;2889846
1;1;1;3;134/05-2016;2016-05-12;1765589
1;1;1;3;152/05-2016;2016-05-25;1057069
1;1;1;3;176/06-2016;2016-06-07;1331740
1;1;1;3;183/06-2016;2016-06-15;1011695
1;1;1;3;187/06-2016;2016-06-21;2651733
1;1;1;3;195/06-2016;2016-06-23;1319748
1;1;1;4;112/04-2016;2016-04-11;2014093
1;1;1;4;118/04-2016;2016-04-15;1599826
1;1;1;4;125/04-2016;2016-04-21;925468
1;1;1;4;134/05-2016;2016-05-12;1583080
1;1;1;4;152/05-2016;2016-05-25;893773
1;1;1;4;176/06-2016;2016-06-07;808443
1;1;1;4;183/06-2016;2016-06-15;1181323
1;1;1;4;187/06-2016;2016-06-21;980606
1;1;1;4;195/06-2016;2016-06-23;2272204
1;1;1;5;112/04-2016;2016-04-11;2168941
1;1;1;5;118/04-2016;2016-04-15;2724430
1;1;1;5;125/04-2016;2016-04-21;2949499
1;1;1;5;134/05-2016;2016-05-12;2137182
1;1;1;5;152/05-2016;2016-05-25;922517
1;1;1;5;176/06-2016;2016-06-07;1313856
1;1;1;5;183/06-2016;2016-06-15;1031763
1;1;1;5;187/06-2016;2016-06-21;1142561
1;1;1;5;195/06-2016;2016-06-23;2615643
1;1;1;6;112/04-2016;2016-04-11;3109682
1;1;1;6;118/04-2016;2016-04-15;2428481
1;1;1;6;125/04-2016;2016-04-21;2540173
1;1;1;6;134/05-2016;2016-05-12;2469369
1;1;1;6;152/05-2016;2016-05-25;965551
1;1;1;6;176/06-2016;2016-06-07;2851949
1;1;1;6;183/06-2016;2016-06-15;1510103
1;1;1;6;187/06-2016;2016-06-21;2894015
1;1;1;6;195/06-2016;2016-06-23;2165222
1;1;1;7;112/04-2016;2016-04-11;3015080
1;1;1;7;118/04-2016;2016-04-15;2483319
1;1;1;7;125/04-2016;2016-04-21;852697
1;1;1;7;134/05-2016;2016-05-12;865022
1;1;1;7;152/05-2016;2016-05-25;2754240
1;1;1;7;176/06-2016;2016-06-07;3101621
1;1;1;7;183/06-2016;2016-06-15;1650431
1;1;1;7;187/06-2016;2016-06-21;1467621
1;1;1;7;195/06-2016;2016-06-23;2076443
1;1;2;1;112/04-2016;2016-04-11;2425976
1;1;2;1;118/04-2016;2016-04-15;1589084
1;1;2;1;125/04-2016;2016-04-21;1263244
1;1;2;1;134/05-2016;2016-05-12;2328984
1;1;2;1;152/05-2016;2016-05-25;1410368
1;1;2;1;176/06-2016;2016-06-07;2621298
1;1;2;1;183/06-2016;2016-06-15;2342112
1;1;2;1;187/06-2016;2016-06-21;2843533
1;1;2;1;195/06-2016;2016-06-23;1541706
1;1;2;2;112/04-2016;2016-04-11;1518879
1;1;2;2;118/04-2016;2016-04-15;2720055
1;1;2;2;125/04-2016;2016-04-21;3031162
1;1;2;2;134/05-2016;2016-05-12;2552566
1;1;2;2;152/05-2016;2016-05-25;1606970
1;1;2;2;176/06-2016;2016-06-07;1631353
1;1;2;2;183/06-2016;2016-06-15;2276955
1;1;2;2;187/06-2016;2016-06-21;860753
1;1;2;2;195/06-2016;2016-06-23;3021327
1;1;2;3;112/04-2016;2016-04-11;2129394
1;1;2;3;118/04-2016;2016-04-15;2725147
1;1;2;3;125/04-2016;2016-04-21;2637665
1;1;2;3;134/05-2016;2016-05-12;2750875
1;1;2;3;152/05-2016;2016-05-25;2059383
1;1;2;3;176/06-2016;2016-06-07;2612799
1;1;2;3;183/06-2016;2016-06-15;1480096
1;1;2;3;187/06-2016;2016-06-21;2077080
1;1;2;3;195/06-2016;2016-06-23;1989324
1;1;2;4;112/04-2016;2016-04-11;985086
1;1;2;4;118/04-2016;2016-04-15;2450080
1;1;2;4;125/04-2016;2016-04-21;1261057
1;1;2;4;134/05-2016;2016-05-12;2745609
1;1;2;4;152/05-2016;2016-05-25;1695241
1;1;2;4;176/06-2016;2016-06-07;2300101
1;1;2;4;183/06-2016;2016-06-15;1056973
1;1;2;4;187/06-2016;2016-06-21;1359637
1;1;2;4;195/06-2016;2016-06-23;3044997
1;1;2;5;112/04-2016;2016-04-11;1403358
1;1;2;5;118/04-2016;2016-04-15;1217301
1;1;2;5;125/04-2016;2016-04-21;2478663
1;1;2;5;134/05-2016;2016-05-12;3108797
1;1;2;5;152/05-2016;2016-05-25;1738930
1;1;2;5;176/06-2016;2016-06-07;2233697
1;1;2;5;183/06-2016;2016-06-15;3132007
1;1;2;5;187/06-2016;2016-06-21;1114447
1;1;2;5;195/06-2016;2016-06-23;1399700
1;1;2;6;112/04-2016;2016-04-11;2934021
1;1;2;6;118/04-2016;2016-04-15;1602711
1;1;2;6;125/04-2016;2016-04-21;1952086
1;1;2;6;134/05-2016;2016-05-12;864550
1;1;2;6;152/05-2016;2016-05-25;1516078
1;1;2;6;176/06-2016;2016-06-07;3007415
1;1;2;6;183/06-2016;2016-06-15;2922475
1;1;2;6;187/06-2016;2016-06-21;1231082
1;1;2;6;195/06-2016;2016-06-23;783495
1;1;2;7;112/04-2016;2016-04-11;2370029
1;1;2;7;118/04-2016;2016-04-15;3097199
1;1;2;7;125/04-2016;2016-04-21;1981479
1;1;2;7;134/05-2016;2016-05-12;1199311
1;1;2;7;152/05-2016;2016-05-25;1074201
1;1;2;7;176/06-2016;2016-06-07;2917708
1;1;2;7;183/06-2016;2016-06-15;1753637
1;1;2;7;187/06-2016;2016-06-21;1274054
1;1;2;7;195/06-2016;2016-06-23;858988
1;2;6;1;112/04-2016;2016-04-11;979175
1;2;6;1;118/04-2016;2016-04-15;2727445
1;2;6;1;125/04-2016;2016-04-21;2111339
1;2;6;1;134/05-2016;2016-05-12;2496766
1;2;6;1;152/05-2016;2016-05-25;2087924
1;2;6;1;176/06-2016;2016-06-07;2051064
1;2;6;1;183/06-2016;2016-06-15;1424413
1;2;6;1;187/06-2016;2016-06-21;2165075
1;2;6;1;195/06-2016;2016-06-23;2115735
1;2;6;2;112/04-2016;2016-04-11;2656866
1;2;6;2;118/04-2016;2016-04-15;1911494
1;2;6;2;125/04-2016;2016-04-21;2648952
1;2;6;2;134/05-2016;2016-05-12;986876
1;2;6;2;152/05-2016;2016-05-25;1920890
1;2;6;2;176/06-2016;2016-06-07;1583057
1;2;6;2;183/06-2016;2016-06-15;1159588
1;2;6;2;187/06-2016;2016-06-21;882197
1;2;6;2;195/06-2016;2016-06-23;1984855
1;2;6;3;112/04-2016;2016-04-11;966097
1;2;6;3;118/04-2016;2016-04-15;2046417
1;2;6;3;125/04-2016;2016-04-21;1292446
1;2;6;3;134/05-2016;2016-05-12;2019312
1;2;6;3;152/05-2016;2016-05-25;2425096
1;2;6;3;176/06-2016;2016-06-07;2050001
1;2;6;3;183/06-2016;2016-06-15;1376521
1;2;6;3;187/06-2016;2016-06-21;2157726
1;2;6;3;195/06-2016;2016-06-23;1571659
1;2;6;4;112/04-2016;2016-04-11;2872237
1;2;6;4;118/04-2016;2016-04-15;2323713
1;2;6;4;125/04-2016;2016-04-21;1811260
1;2;6;4;134/05-2016;2016-05-12;2918092
1;2;6;4;152/05-2016;2016-05-25;1195998
1;2;6;4;176/06-2016;2016-06-07;2389960
1;2;6;4;183/06-2016;2016-06-15;957490
1;2;6;4;187/06-2016;2016-06-21;2820919
1;2;6;4;195/06-2016;2016-06-23;2227425
1;2;6;5;112/04-2016;2016-04-11;931493
1;2;6;5;118/04-2016;2016-04-15;2175640
1;2;6;5;125/04-2016;2016-04-21;1304343
1;2;6;5;134/05-2016;2016-05-12;2590481
1;2;6;5;152/05-2016;2016-05-25;1831473
1;2;6;5;176/06-2016;2016-06-07;2037010
1;2;6;5;183/06-2016;2016-06-15;2251273
1;2;6;5;187/06-2016;2016-06-21;1816786
1;2;6;5;195/06-2016;2016-06-23;1378717
1;2;6;6;112/04-2016;2016-04-11;2371561
1;2;6;6;118/04-2016;2016-04-15;1805465
1;2;6;6;125/04-2016;2016-04-21;1566768
1;2;6;6;134/05-2016;2016-05-12;1261365
1;2;6;6;152/05-2016;2016-05-25;877627
1;2;6;6;176/06-2016;2016-06-07;2194004
1;2;6;6;183/06-2016;2016-06-15;1240598
1;2;6;6;187/06-2016;2016-06-21;1743204
1;2;6;6;195/06-2016;2016-06-23;1944673
1;2;6;7;112/04-2016;2016-04-11;955504
1;2;6;7;118/04-2016;2016-04-15;1588943
1;2;6;7;125/04-2016;2016-04-21;1972304
1;2;6;7;134/05-2016;2016-05-12;2779373
1;2;6;7;152/05-2016;2016-05-25;3027272
1;2;6;7;176/06-2016;2016-06-07;1960512
1;2;6;7;183/06-2016;2016-06-15;2836000
1;2;6;7;187/06-2016;2016-06-21;2087609
1;2;6;7;195/06-2016;2016-06-23;840079
2;0;45;1;112/04-2016;2016-04-11;979375
2;0;45;1;118/04-2016;2016-04-15;272745
2;0;45;1;125/04-2016;2016-04-21;211339
2;0;45;1;134/05-2016;2016-05-12;249766
2;0;45;1;152/05-2016;2016-05-25;208724
2;0;45;1;176/06-2016;2016-06-07;205064
2;0;45;1;183/06-2016;2016-06-15;142413
2;0;45;1;187/06-2016;2016-06-21;216075
2;0;45;1;195/06-2016;2016-06-23;211535
2;0;45;2;112/04-2016;2016-04-11;265666
2;0;45;2;118/04-2016;2016-04-15;191494
2;0;45;2;125/04-2016;2016-04-21;264952
2;0;45;2;134/05-2016;2016-05-12;986876
2;0;45;2;152/05-2016;2016-05-25;192890
2;0;45;2;176/06-2016;2016-06-07;158057
2;0;45;2;183/06-2016;2016-06-15;115588
2;0;45;2;187/06-2016;2016-06-21;882197
2;0;45;2;195/06-2016;2016-06-23;198855
2;0;45;3;112/04-2016;2016-04-11;96697
2;0;45;3;118/04-2016;2016-04-15;204417
2;0;45;3;125/04-2016;2016-04-21;129446
2;0;45;3;134/05-2016;2016-05-12;201312
2;0;45;3;152/05-2016;2016-05-25;242096
2;0;45;3;176/06-2016;2016-06-07;205001
2;0;45;3;183/06-2016;2016-06-15;137521
2;0;45;3;187/06-2016;2016-06-21;215726
2;0;45;3;195/06-2016;2016-06-23;157659
2;0;45;4;112/04-2016;2016-04-11;287237
2;0;45;4;118/04-2016;2016-04-15;232713
2;0;45;4;125/04-2016;2016-04-21;181260
2;0;45;4;134/05-2016;2016-05-12;291092
2;0;45;4;152/05-2016;2016-05-25;119998
2;0;45;4;176/06-2016;2016-06-07;238960
2;0;45;4;183/06-2016;2016-06-15;95790
2;0;45;4;187/06-2016;2016-06-21;282919
2;0;45;4;195/06-2016;2016-06-23;222425
2;0;45;5;112/04-2016;2016-04-11;93193
2;0;45;5;118/04-2016;2016-04-15;217640
2;0;45;5;125/04-2016;2016-04-21;130343
2;0;45;5;134/05-2016;2016-05-12;259481
2;0;45;5;152/05-2016;2016-05-25;183473
2;0;45;5;176/06-2016;2016-06-07;203010
2;0;45;5;183/06-2016;2016-06-15;225273
2;0;45;5;187/06-2016;2016-06-21;181786
2;0;45;5;195/06-2016;2016-06-23;137717
2;0;45;6;112/04-2016;2016-04-11;237561
2;0;45;6;118/04-2016;2016-04-15;180465
2;0;45;6;125/04-2016;2016-04-21;156768
2;0;45;6;134/05-2016;2016-05-12;126365
2;0;45;6;152/05-2016;2016-05-25;87727
2;0;45;6;176/06-2016;2016-06-07;219004
2;0;45;6;183/06-2016;2016-06-15;124598
2;0;45;6;187/06-2016;2016-06-21;174204
2;0;45;6;195/06-2016;2016-06-23;194673
2;0;45;7;112/04-2016;2016-04-11;95504
2;0;45;7;118/04-2016;2016-04-15;158943
2;0;45;7;125/04-2016;2016-04-21;197304
2;0;45;7;134/05-2016;2016-05-12;277373
2;0;45;7;152/05-2016;2016-05-25;302272
2;0;45;7;176/06-2016;2016-06-07;196512
2;0;45;7;183/06-2016;2016-06-15;283000
2;0;45;7;187/06-2016;2016-06-21;208609
2;0;45;7;195/06-2016;2016-06-23;84079

// * Страны
//countryId;name
1;Россия
2;Беларусь

// * Регионы
//regionId;name
0;
1;Москва
2;Московская область

// * Компании
//companyId;name
1;ООО РДЭ
2;ЗАО СК ГРИФОН
3;ООО Энергодрайв
4;ЗАО НФ АК ПРАКТИК
5;Группа компаний Электромотор
6;ООО Электростиль
7;АО Электроагрегат
8;ООО ВЭТК ГК
9;ООО Росэлектро ТД
10;ООО АМКТ
11;ООО КВ-Индастри
12;ООО СЗЭМО Электродвигатель
13;ЗАО Энергопром
14;ООО ЛОНГРИ
15;ООО Электростиль Киров
16;ООО Электростиль Набережные Челны
17;ООО Электростиль Нижний Новгород
18;ООО Русэлпром-Урал
19;ООО Уралстройинвест
20;ЗАО КОНСАР
21;ОАО АЭРОМАШ
22;ООО Электростиль Уфа
23;ООО Электростиль Краснодар
24;ООО Насосэнергомаш
25;ООО Электростиль Ростов-на-Дону
26;ООО Энергоиндустрия ПО
27;Иркутскпромоборудование
28;ООО СИБТЭК
29;ООО Русэлпром-Кузбасс
30;ООО СГК ТД
31;ООО Электростиль Новосибирск
32;ООО Торговая компания ТЭС
33;ООО Энергоснабкомплект
34;ООО Электростиль Екатеринбург
35;ООО Сибирский тракт
36;ООО Дальэнергооборудование
37;ООО Электростиль Хабаровск
38;ТОО Energotechnic
39;ТОО НПФ АВИА
40;ООО Энергия
41;ООО РОСУКРЭЛПРОМ
42;ООО ЛБЮ-Тех
43;ООО ТД ЭНЕРГОПРОМ КР
44;ООО Русэлпром-Украина
45;ООО Техноэкссервис
46;SIA EnergoStar
47;Сиана Електрик ЕООД

// * Продукция
//productId;name
1;Низковольтные электродвигатели
2;Высоковольтные электродвигатели
3;Генераторы
4;Системы управления электромашинами
5;Трансформаторы и реакторы
6;Электропривод транспорта
7;Прочее";

        public static string SourceData =
@"<ReportData>
  <Data>
    <Country name='Россия'>
      <Region name='Москва'>
        <Company companyId='1'>
          <Sale productId='1' contract='112/04-2016' date='2016-04-11' sum='2053673' />
          <Sale productId='1' contract='118/04-2016' date='2016-04-15' sum='3106752' />
          <Sale productId='1' contract='125/04-2016' date='2016-04-21' sum='2837659' />
          <Sale productId='1' contract='134/05-2016' date='2016-05-12' sum='1921061' />
          <Sale productId='1' contract='152/05-2016' date='2016-05-25' sum='2361842' />
          <Sale productId='1' contract='176/06-2016' date='2016-06-07' sum='2227749' />
          <Sale productId='1' contract='183/06-2016' date='2016-06-15' sum='2872523' />
          <Sale productId='1' contract='187/06-2016' date='2016-06-21' sum='1867594' />
          <Sale productId='1' contract='195/06-2016' date='2016-06-23' sum='2148918' />
          <Sale productId='2' contract='112/04-2016' date='2016-04-11' sum='1753967' />
          <Sale productId='2' contract='118/04-2016' date='2016-04-15' sum='1716989' />
          <Sale productId='2' contract='125/04-2016' date='2016-04-21' sum='780789' />
          <Sale productId='2' contract='134/05-2016' date='2016-05-12' sum='2543985' />
          <Sale productId='2' contract='152/05-2016' date='2016-05-25' sum='1621460' />
          <Sale productId='2' contract='176/06-2016' date='2016-06-07' sum='2593240' />
          <Sale productId='2' contract='183/06-2016' date='2016-06-15' sum='2188057' />
          <Sale productId='2' contract='187/06-2016' date='2016-06-21' sum='2788386' />
          <Sale productId='2' contract='195/06-2016' date='2016-06-23' sum='885713' />
          <Sale productId='3' contract='112/04-2016' date='2016-04-11' sum='2748916' />
          <Sale productId='3' contract='118/04-2016' date='2016-04-15' sum='2760774' />
          <Sale productId='3' contract='125/04-2016' date='2016-04-21' sum='2889846' />
          <Sale productId='3' contract='134/05-2016' date='2016-05-12' sum='1765589' />
          <Sale productId='3' contract='152/05-2016' date='2016-05-25' sum='1057069' />
          <Sale productId='3' contract='176/06-2016' date='2016-06-07' sum='1331740' />
          <Sale productId='3' contract='183/06-2016' date='2016-06-15' sum='1011695' />
          <Sale productId='3' contract='187/06-2016' date='2016-06-21' sum='2651733' />
          <Sale productId='3' contract='195/06-2016' date='2016-06-23' sum='1319748' />
          <Sale productId='4' contract='112/04-2016' date='2016-04-11' sum='2014093' />
          <Sale productId='4' contract='118/04-2016' date='2016-04-15' sum='1599826' />
          <Sale productId='4' contract='125/04-2016' date='2016-04-21' sum='925468' />
          <Sale productId='4' contract='134/05-2016' date='2016-05-12' sum='1583080' />
          <Sale productId='4' contract='152/05-2016' date='2016-05-25' sum='893773' />
          <Sale productId='4' contract='176/06-2016' date='2016-06-07' sum='808443' />
          <Sale productId='4' contract='183/06-2016' date='2016-06-15' sum='1181323' />
          <Sale productId='4' contract='187/06-2016' date='2016-06-21' sum='980606' />
          <Sale productId='4' contract='195/06-2016' date='2016-06-23' sum='2272204' />
          <Sale productId='5' contract='112/04-2016' date='2016-04-11' sum='2168941' />
          <Sale productId='5' contract='118/04-2016' date='2016-04-15' sum='2724430' />
          <Sale productId='5' contract='125/04-2016' date='2016-04-21' sum='2949499' />
          <Sale productId='5' contract='134/05-2016' date='2016-05-12' sum='2137182' />
          <Sale productId='5' contract='152/05-2016' date='2016-05-25' sum='922517' />
          <Sale productId='5' contract='176/06-2016' date='2016-06-07' sum='1313856' />
          <Sale productId='5' contract='183/06-2016' date='2016-06-15' sum='1031763' />
          <Sale productId='5' contract='187/06-2016' date='2016-06-21' sum='1142561' />
          <Sale productId='5' contract='195/06-2016' date='2016-06-23' sum='2615643' />
          <Sale productId='6' contract='112/04-2016' date='2016-04-11' sum='3109682' />
          <Sale productId='6' contract='118/04-2016' date='2016-04-15' sum='2428481' />
          <Sale productId='6' contract='125/04-2016' date='2016-04-21' sum='2540173' />
          <Sale productId='6' contract='134/05-2016' date='2016-05-12' sum='2469369' />
          <Sale productId='6' contract='152/05-2016' date='2016-05-25' sum='965551' />
          <Sale productId='6' contract='176/06-2016' date='2016-06-07' sum='2851949' />
          <Sale productId='6' contract='183/06-2016' date='2016-06-15' sum='1510103' />
          <Sale productId='6' contract='187/06-2016' date='2016-06-21' sum='2894015' />
          <Sale productId='6' contract='195/06-2016' date='2016-06-23' sum='2165222' />
          <Sale productId='7' contract='112/04-2016' date='2016-04-11' sum='3015080' />
          <Sale productId='7' contract='118/04-2016' date='2016-04-15' sum='2483319' />
          <Sale productId='7' contract='125/04-2016' date='2016-04-21' sum='852697' />
          <Sale productId='7' contract='134/05-2016' date='2016-05-12' sum='865022' />
          <Sale productId='7' contract='152/05-2016' date='2016-05-25' sum='2754240' />
          <Sale productId='7' contract='176/06-2016' date='2016-06-07' sum='3101621' />
          <Sale productId='7' contract='183/06-2016' date='2016-06-15' sum='1650431' />
          <Sale productId='7' contract='187/06-2016' date='2016-06-21' sum='1467621' />
          <Sale productId='7' contract='195/06-2016' date='2016-06-23' sum='2076443' />
        </Company>
        <Company companyId='2'>
          <Sale productId='1' contract='112/04-2016' date='2016-04-11' sum='2425976' />
          <Sale productId='1' contract='118/04-2016' date='2016-04-15' sum='1589084' />
          <Sale productId='1' contract='125/04-2016' date='2016-04-21' sum='1263244' />
          <Sale productId='1' contract='134/05-2016' date='2016-05-12' sum='2328984' />
          <Sale productId='1' contract='152/05-2016' date='2016-05-25' sum='1410368' />
          <Sale productId='1' contract='176/06-2016' date='2016-06-07' sum='2621298' />
          <Sale productId='1' contract='183/06-2016' date='2016-06-15' sum='2342112' />
          <Sale productId='1' contract='187/06-2016' date='2016-06-21' sum='2843533' />
          <Sale productId='1' contract='195/06-2016' date='2016-06-23' sum='1541706' />
          <Sale productId='2' contract='112/04-2016' date='2016-04-11' sum='1518879' />
          <Sale productId='2' contract='118/04-2016' date='2016-04-15' sum='2720055' />
          <Sale productId='2' contract='125/04-2016' date='2016-04-21' sum='3031162' />
          <Sale productId='2' contract='134/05-2016' date='2016-05-12' sum='2552566' />
          <Sale productId='2' contract='152/05-2016' date='2016-05-25' sum='1606970' />
          <Sale productId='2' contract='176/06-2016' date='2016-06-07' sum='1631353' />
          <Sale productId='2' contract='183/06-2016' date='2016-06-15' sum='2276955' />
          <Sale productId='2' contract='187/06-2016' date='2016-06-21' sum='860753' />
          <Sale productId='2' contract='195/06-2016' date='2016-06-23' sum='3021327' />
          <Sale productId='3' contract='112/04-2016' date='2016-04-11' sum='2129394' />
          <Sale productId='3' contract='118/04-2016' date='2016-04-15' sum='2725147' />
          <Sale productId='3' contract='125/04-2016' date='2016-04-21' sum='2637665' />
          <Sale productId='3' contract='134/05-2016' date='2016-05-12' sum='2750875' />
          <Sale productId='3' contract='152/05-2016' date='2016-05-25' sum='2059383' />
          <Sale productId='3' contract='176/06-2016' date='2016-06-07' sum='2612799' />
          <Sale productId='3' contract='183/06-2016' date='2016-06-15' sum='1480096' />
          <Sale productId='3' contract='187/06-2016' date='2016-06-21' sum='2077080' />
          <Sale productId='3' contract='195/06-2016' date='2016-06-23' sum='1989324' />
          <Sale productId='4' contract='112/04-2016' date='2016-04-11' sum='985086' />
          <Sale productId='4' contract='118/04-2016' date='2016-04-15' sum='2450080' />
          <Sale productId='4' contract='125/04-2016' date='2016-04-21' sum='1261057' />
          <Sale productId='4' contract='134/05-2016' date='2016-05-12' sum='2745609' />
          <Sale productId='4' contract='152/05-2016' date='2016-05-25' sum='1695241' />
          <Sale productId='4' contract='176/06-2016' date='2016-06-07' sum='2300101' />
          <Sale productId='4' contract='183/06-2016' date='2016-06-15' sum='1056973' />
          <Sale productId='4' contract='187/06-2016' date='2016-06-21' sum='1359637' />
          <Sale productId='4' contract='195/06-2016' date='2016-06-23' sum='3044997' />
          <Sale productId='5' contract='112/04-2016' date='2016-04-11' sum='1403358' />
          <Sale productId='5' contract='118/04-2016' date='2016-04-15' sum='1217301' />
          <Sale productId='5' contract='125/04-2016' date='2016-04-21' sum='2478663' />
          <Sale productId='5' contract='134/05-2016' date='2016-05-12' sum='3108797' />
          <Sale productId='5' contract='152/05-2016' date='2016-05-25' sum='1738930' />
          <Sale productId='5' contract='176/06-2016' date='2016-06-07' sum='2233697' />
          <Sale productId='5' contract='183/06-2016' date='2016-06-15' sum='3132007' />
          <Sale productId='5' contract='187/06-2016' date='2016-06-21' sum='1114447' />
          <Sale productId='5' contract='195/06-2016' date='2016-06-23' sum='1399700' />
          <Sale productId='6' contract='112/04-2016' date='2016-04-11' sum='2934021' />
          <Sale productId='6' contract='118/04-2016' date='2016-04-15' sum='1602711' />
          <Sale productId='6' contract='125/04-2016' date='2016-04-21' sum='1952086' />
          <Sale productId='6' contract='134/05-2016' date='2016-05-12' sum='864550' />
          <Sale productId='6' contract='152/05-2016' date='2016-05-25' sum='1516078' />
          <Sale productId='6' contract='176/06-2016' date='2016-06-07' sum='3007415' />
          <Sale productId='6' contract='183/06-2016' date='2016-06-15' sum='2922475' />
          <Sale productId='6' contract='187/06-2016' date='2016-06-21' sum='1231082' />
          <Sale productId='6' contract='195/06-2016' date='2016-06-23' sum='783495' />
          <Sale productId='7' contract='112/04-2016' date='2016-04-11' sum='2370029' />
          <Sale productId='7' contract='118/04-2016' date='2016-04-15' sum='3097199' />
          <Sale productId='7' contract='125/04-2016' date='2016-04-21' sum='1981479' />
          <Sale productId='7' contract='134/05-2016' date='2016-05-12' sum='1199311' />
          <Sale productId='7' contract='152/05-2016' date='2016-05-25' sum='1074201' />
          <Sale productId='7' contract='176/06-2016' date='2016-06-07' sum='2917708' />
          <Sale productId='7' contract='183/06-2016' date='2016-06-15' sum='1753637' />
          <Sale productId='7' contract='187/06-2016' date='2016-06-21' sum='1274054' />
          <Sale productId='7' contract='195/06-2016' date='2016-06-23' sum='858988' />
        </Company>
      </Region>
      <Region name='Московская область'>
        <Company companyId='6'>
          <Sale productId='1' contract='112/04-2016' date='2016-04-11' sum='979175' />
          <Sale productId='1' contract='118/04-2016' date='2016-04-15' sum='2727445' />
          <Sale productId='1' contract='125/04-2016' date='2016-04-21' sum='2111339' />
          <Sale productId='1' contract='134/05-2016' date='2016-05-12' sum='2496766' />
          <Sale productId='1' contract='152/05-2016' date='2016-05-25' sum='2087924' />
          <Sale productId='1' contract='176/06-2016' date='2016-06-07' sum='2051064' />
          <Sale productId='1' contract='183/06-2016' date='2016-06-15' sum='1424413' />
          <Sale productId='1' contract='187/06-2016' date='2016-06-21' sum='2165075' />
          <Sale productId='1' contract='195/06-2016' date='2016-06-23' sum='2115735' />
          <Sale productId='2' contract='112/04-2016' date='2016-04-11' sum='2656866' />
          <Sale productId='2' contract='118/04-2016' date='2016-04-15' sum='1911494' />
          <Sale productId='2' contract='125/04-2016' date='2016-04-21' sum='2648952' />
          <Sale productId='2' contract='134/05-2016' date='2016-05-12' sum='986876' />
          <Sale productId='2' contract='152/05-2016' date='2016-05-25' sum='1920890' />
          <Sale productId='2' contract='176/06-2016' date='2016-06-07' sum='1583057' />
          <Sale productId='2' contract='183/06-2016' date='2016-06-15' sum='1159588' />
          <Sale productId='2' contract='187/06-2016' date='2016-06-21' sum='882197' />
          <Sale productId='2' contract='195/06-2016' date='2016-06-23' sum='1984855' />
          <Sale productId='3' contract='112/04-2016' date='2016-04-11' sum='966097' />
          <Sale productId='3' contract='118/04-2016' date='2016-04-15' sum='2046417' />
          <Sale productId='3' contract='125/04-2016' date='2016-04-21' sum='1292446' />
          <Sale productId='3' contract='134/05-2016' date='2016-05-12' sum='2019312' />
          <Sale productId='3' contract='152/05-2016' date='2016-05-25' sum='2425096' />
          <Sale productId='3' contract='176/06-2016' date='2016-06-07' sum='2050001' />
          <Sale productId='3' contract='183/06-2016' date='2016-06-15' sum='1376521' />
          <Sale productId='3' contract='187/06-2016' date='2016-06-21' sum='2157726' />
          <Sale productId='3' contract='195/06-2016' date='2016-06-23' sum='1571659' />
          <Sale productId='4' contract='112/04-2016' date='2016-04-11' sum='2872237' />
          <Sale productId='4' contract='118/04-2016' date='2016-04-15' sum='2323713' />
          <Sale productId='4' contract='125/04-2016' date='2016-04-21' sum='1811260' />
          <Sale productId='4' contract='134/05-2016' date='2016-05-12' sum='2918092' />
          <Sale productId='4' contract='152/05-2016' date='2016-05-25' sum='1195998' />
          <Sale productId='4' contract='176/06-2016' date='2016-06-07' sum='2389960' />
          <Sale productId='4' contract='183/06-2016' date='2016-06-15' sum='957490' />
          <Sale productId='4' contract='187/06-2016' date='2016-06-21' sum='2820919' />
          <Sale productId='4' contract='195/06-2016' date='2016-06-23' sum='2227425' />
          <Sale productId='5' contract='112/04-2016' date='2016-04-11' sum='931493' />
          <Sale productId='5' contract='118/04-2016' date='2016-04-15' sum='2175640' />
          <Sale productId='5' contract='125/04-2016' date='2016-04-21' sum='1304343' />
          <Sale productId='5' contract='134/05-2016' date='2016-05-12' sum='2590481' />
          <Sale productId='5' contract='152/05-2016' date='2016-05-25' sum='1831473' />
          <Sale productId='5' contract='176/06-2016' date='2016-06-07' sum='2037010' />
          <Sale productId='5' contract='183/06-2016' date='2016-06-15' sum='2251273' />
          <Sale productId='5' contract='187/06-2016' date='2016-06-21' sum='1816786' />
          <Sale productId='5' contract='195/06-2016' date='2016-06-23' sum='1378717' />
          <Sale productId='6' contract='112/04-2016' date='2016-04-11' sum='2371561' />
          <Sale productId='6' contract='118/04-2016' date='2016-04-15' sum='1805465' />
          <Sale productId='6' contract='125/04-2016' date='2016-04-21' sum='1566768' />
          <Sale productId='6' contract='134/05-2016' date='2016-05-12' sum='1261365' />
          <Sale productId='6' contract='152/05-2016' date='2016-05-25' sum='877627' />
          <Sale productId='6' contract='176/06-2016' date='2016-06-07' sum='2194004' />
          <Sale productId='6' contract='183/06-2016' date='2016-06-15' sum='1240598' />
          <Sale productId='6' contract='187/06-2016' date='2016-06-21' sum='1743204' />
          <Sale productId='6' contract='195/06-2016' date='2016-06-23' sum='1944673' />
          <Sale productId='7' contract='112/04-2016' date='2016-04-11' sum='955504' />
          <Sale productId='7' contract='118/04-2016' date='2016-04-15' sum='1588943' />
          <Sale productId='7' contract='125/04-2016' date='2016-04-21' sum='1972304' />
          <Sale productId='7' contract='134/05-2016' date='2016-05-12' sum='2779373' />
          <Sale productId='7' contract='152/05-2016' date='2016-05-25' sum='3027272' />
          <Sale productId='7' contract='176/06-2016' date='2016-06-07' sum='1960512' />
          <Sale productId='7' contract='183/06-2016' date='2016-06-15' sum='2836000' />
          <Sale productId='7' contract='187/06-2016' date='2016-06-21' sum='2087609' />
          <Sale productId='7' contract='195/06-2016' date='2016-06-23' sum='840079' />
        </Company>
      </Region>
    </Country>
    <Country name='Беларусь'>
      <Region name=''>
        <Company companyId='45'>
          <Sale productId='1' contract='112/04-2016' date='2016-04-11' sum='979375' />
          <Sale productId='1' contract='118/04-2016' date='2016-04-15' sum='272745' />
          <Sale productId='1' contract='125/04-2016' date='2016-04-21' sum='211339' />
          <Sale productId='1' contract='134/05-2016' date='2016-05-12' sum='249766' />
          <Sale productId='1' contract='152/05-2016' date='2016-05-25' sum='208724' />
          <Sale productId='1' contract='176/06-2016' date='2016-06-07' sum='205064' />
          <Sale productId='1' contract='183/06-2016' date='2016-06-15' sum='142413' />
          <Sale productId='1' contract='187/06-2016' date='2016-06-21' sum='216075' />
          <Sale productId='1' contract='195/06-2016' date='2016-06-23' sum='211535' />
          <Sale productId='2' contract='112/04-2016' date='2016-04-11' sum='265666' />
          <Sale productId='2' contract='118/04-2016' date='2016-04-15' sum='191494' />
          <Sale productId='2' contract='125/04-2016' date='2016-04-21' sum='264952' />
          <Sale productId='2' contract='134/05-2016' date='2016-05-12' sum='986876' />
          <Sale productId='2' contract='152/05-2016' date='2016-05-25' sum='192890' />
          <Sale productId='2' contract='176/06-2016' date='2016-06-07' sum='158057' />
          <Sale productId='2' contract='183/06-2016' date='2016-06-15' sum='115588' />
          <Sale productId='2' contract='187/06-2016' date='2016-06-21' sum='882197' />
          <Sale productId='2' contract='195/06-2016' date='2016-06-23' sum='198855' />
          <Sale productId='3' contract='112/04-2016' date='2016-04-11' sum='96697' />
          <Sale productId='3' contract='118/04-2016' date='2016-04-15' sum='204417' />
          <Sale productId='3' contract='125/04-2016' date='2016-04-21' sum='129446' />
          <Sale productId='3' contract='134/05-2016' date='2016-05-12' sum='201312' />
          <Sale productId='3' contract='152/05-2016' date='2016-05-25' sum='242096' />
          <Sale productId='3' contract='176/06-2016' date='2016-06-07' sum='205001' />
          <Sale productId='3' contract='183/06-2016' date='2016-06-15' sum='137521' />
          <Sale productId='3' contract='187/06-2016' date='2016-06-21' sum='215726' />
          <Sale productId='3' contract='195/06-2016' date='2016-06-23' sum='157659' />
          <Sale productId='4' contract='112/04-2016' date='2016-04-11' sum='287237' />
          <Sale productId='4' contract='118/04-2016' date='2016-04-15' sum='232713' />
          <Sale productId='4' contract='125/04-2016' date='2016-04-21' sum='181260' />
          <Sale productId='4' contract='134/05-2016' date='2016-05-12' sum='291092' />
          <Sale productId='4' contract='152/05-2016' date='2016-05-25' sum='119998' />
          <Sale productId='4' contract='176/06-2016' date='2016-06-07' sum='238960' />
          <Sale productId='4' contract='183/06-2016' date='2016-06-15' sum='95790' />
          <Sale productId='4' contract='187/06-2016' date='2016-06-21' sum='282919' />
          <Sale productId='4' contract='195/06-2016' date='2016-06-23' sum='222425' />
          <Sale productId='5' contract='112/04-2016' date='2016-04-11' sum='93193' />
          <Sale productId='5' contract='118/04-2016' date='2016-04-15' sum='217640' />
          <Sale productId='5' contract='125/04-2016' date='2016-04-21' sum='130343' />
          <Sale productId='5' contract='134/05-2016' date='2016-05-12' sum='259481' />
          <Sale productId='5' contract='152/05-2016' date='2016-05-25' sum='183473' />
          <Sale productId='5' contract='176/06-2016' date='2016-06-07' sum='203010' />
          <Sale productId='5' contract='183/06-2016' date='2016-06-15' sum='225273' />
          <Sale productId='5' contract='187/06-2016' date='2016-06-21' sum='181786' />
          <Sale productId='5' contract='195/06-2016' date='2016-06-23' sum='137717' />
          <Sale productId='6' contract='112/04-2016' date='2016-04-11' sum='237561' />
          <Sale productId='6' contract='118/04-2016' date='2016-04-15' sum='180465' />
          <Sale productId='6' contract='125/04-2016' date='2016-04-21' sum='156768' />
          <Sale productId='6' contract='134/05-2016' date='2016-05-12' sum='126365' />
          <Sale productId='6' contract='152/05-2016' date='2016-05-25' sum='87727' />
          <Sale productId='6' contract='176/06-2016' date='2016-06-07' sum='219004' />
          <Sale productId='6' contract='183/06-2016' date='2016-06-15' sum='124598' />
          <Sale productId='6' contract='187/06-2016' date='2016-06-21' sum='174204' />
          <Sale productId='6' contract='195/06-2016' date='2016-06-23' sum='194673' />
          <Sale productId='7' contract='112/04-2016' date='2016-04-11' sum='95504' />
          <Sale productId='7' contract='118/04-2016' date='2016-04-15' sum='158943' />
          <Sale productId='7' contract='125/04-2016' date='2016-04-21' sum='197304' />
          <Sale productId='7' contract='134/05-2016' date='2016-05-12' sum='277373' />
          <Sale productId='7' contract='152/05-2016' date='2016-05-25' sum='302272' />
          <Sale productId='7' contract='176/06-2016' date='2016-06-07' sum='196512' />
          <Sale productId='7' contract='183/06-2016' date='2016-06-15' sum='283000' />
          <Sale productId='7' contract='187/06-2016' date='2016-06-21' sum='208609' />
          <Sale productId='7' contract='195/06-2016' date='2016-06-23' sum='84079' />
        </Company>
      </Region>
    </Country>
  </Data>
  <References>
    <Companies>
      <Company id='1' name='ООО РДЭ' />
      <Company id='2' name='ЗАО СК ГРИФОН' />
      <Company id='3' name='ООО Энергодрайв' />
      <Company id='4' name='ЗАО НФ АК ПРАКТИК' />
      <Company id='5' name='Группа компаний Электромотор' />
      <Company id='6' name='ООО Электростиль' />
      <Company id='7' name='АО Электроагрегат' />
      <Company id='8' name='ООО ВЭТК ГК' />
      <Company id='9' name='ООО Росэлектро ТД' />
      <Company id='10' name='ООО АМКТ' />
      <Company id='11' name='ООО КВ-Индастри' />
      <Company id='12' name='ООО СЗЭМО Электродвигатель' />
      <Company id='13' name='ЗАО Энергопром' />
      <Company id='14' name='ООО ЛОНГРИ' />
      <Company id='15' name='ООО Электростиль Киров' />
      <Company id='16' name='ООО Электростиль Набережные Челны' />
      <Company id='17' name='ООО Электростиль Нижний Новгород' />
      <Company id='18' name='ООО Русэлпром-Урал' />
      <Company id='19' name='ООО Уралстройинвест' />
      <Company id='20' name='ЗАО КОНСАР' />
      <Company id='21' name='ОАО АЭРОМАШ' />
      <Company id='22' name='ООО Электростиль Уфа' />
      <Company id='23' name='ООО Электростиль Краснодар' />
      <Company id='24' name='ООО Насосэнергомаш' />
      <Company id='25' name='ООО Электростиль Ростов-на-Дону' />
      <Company id='26' name='ООО Энергоиндустрия ПО' />
      <Company id='27' name='Иркутскпромоборудование' />
      <Company id='28' name='ООО СИБТЭК' />
      <Company id='29' name='ООО Русэлпром-Кузбасс' />
      <Company id='30' name='ООО СГК ТД' />
      <Company id='31' name='ООО Электростиль Новосибирск' />
      <Company id='32' name='ООО Торговая компания ТЭС' />
      <Company id='33' name='ООО Энергоснабкомплект' />
      <Company id='34' name='ООО Электростиль Екатеринбург' />
      <Company id='35' name='ООО Сибирский тракт' />
      <Company id='36' name='ООО Дальэнергооборудование' />
      <Company id='37' name='ООО Электростиль Хабаровск' />
      <Company id='38' name='ТОО Energotechnic' />
      <Company id='39' name='ТОО НПФ АВИА' />
      <Company id='40' name='ООО Энергия' />
      <Company id='41' name='ООО РОСУКРЭЛПРОМ' />
      <Company id='42' name='ООО ЛБЮ-Тех' />
      <Company id='43' name='ООО ТД ЭНЕРГОПРОМ КР' />
      <Company id='44' name='ООО Русэлпром-Украина' />
      <Company id='45' name='ООО Техноэкссервис' />
      <Company id='46' name='SIA EnergoStar' />
      <Company id='47' name='Сиана Електрик ЕООД' />
    </Companies>
    <Products>
      <Product id='1' name='Низковольтные электродвигатели' />
      <Product id='2' name='Высоковольтные электродвигатели' />
      <Product id='3' name='Генераторы' />
      <Product id='4' name='Системы управления электромашинами' />
      <Product id='5' name='Трансформаторы и реакторы' />
      <Product id='6' name='Электропривод транспорта' />
      <Product id='7' name='Прочее' />
    </Products>
  </References>
</ReportData>";

        #endregion Тестовые данные
    }
}